In [1]:
import pandas as pd

In [22]:
# Converting txt to csv

In [57]:
df=pd.read_csv(r'C:\Users\pooja sinalkar\Downloads\New_Temperature.csv')

In [58]:
df.head()

   year  temp
0  1900    39
1  1900    14
2  1900     5
3  1900    11
4  1900    20

In [59]:
df.dtypes

year    int64
temp    int64
dtype: object

In [61]:
unique=df['year'].unique()

In [64]:
df.describe()

              year         temp
count  1199.000000  1199.000000
mean   1957.679733    24.647206
std      32.467976    14.387256
min    1900.000000     0.000000
25%    1930.000000    12.000000
50%    1957.000000    25.000000
75%    1985.000000    37.000000
max    2013.000000    49.000000

In [89]:
df.groupby(['year'])["temp"].max()

year
1900    46
1901    48
1902    49
1903    35
1904    46
        ..
2009    43
2010    47
2011    42
2012    45
2013    49
Name: temp, Length: 114, dtype: int64